# 

link: https://tryhackme.com/room/redteamthreatintel?utm_campaign=social_share&utm_medium=social&utm_content=room&utm_source=copy&sharerId=6939e0bdb7964810692cdc70

Summary:
צוות אדום יכול לעבוד עם מודיעין איומים (TI) או מודיעין איומים בסייבר (CTI)
הם מחליטין לאיזה קבוצת תוקפים להתחזות כדי לבדוק אם הצוות הכחול יודע לזהות אותה ולהתגונן מפניה.
המודיעין נותן את כל המידע על אופי פעילות קבוצת האויב שנבחרה
אוספים גם IOCs (Indicators of Compromise)  - אלו סימנים טכניים שמעידים על פריצה
ואוספים גם TTPs - טקטיקות, טכניקות ונהלים שלהם
ויסווגו אותם על סמן מאפיינם שונים, כמו:
Threat Group
Kill Chain Phase
Tactic
Objective/Goal
בסך הכל, הצוות האדום צורך מודיעין איומים כדי לנתח ולחקות את התנהגויותיהם של יריבים באמצעות TTPs ו-IOCs שנאספו.

מיפוי TTP לשרשרת הריגות 

ראיתי את האתר של MITRE ATT&CK ובחנתי את שיטות הפעולה של carbanak.

הצוות האדום לא רק מתכנן תקיפה כמו האויב שנבחר, אלא גם בעת התקיפה עצמה משתמש באותם פורטים וזמני התקשרות כמוהו, ובאותם פקודות מערכת וקבצים, על מנת להיראות בדיוק כמו האויב.
כשמתכננים לצאת לקרב צריך לבחון תרחישים מכל הפרספקטיבות.  התקפית, הגנתית, ופרספקטיבת היריב. לבחון כל פרט ממתודולוגיית התקיפה שלו
כמו שעשיתי בתרגילים - בחינה לעומק של תוכנות בהם היריב משתמש, ודרכים בהם הוא תוקף, הכלים בהם משתמש וכדומה
